test_cases/OnSet_Set1_Ma-0.75_Re-10Mio_GaussLinear_alpha-4_FineMesh/system/FOsurfaceSample
surface
{
    type            surfaces;
    libs            (sampling);
    writeControl    writeTime;

    surfaceFormat   raw;
    fields          (total(p)_coeff yPlus p rho T);

    // interpolationScheme cellPoint;  //<- default

    surfaces
    {
        airfoil
        {
            type            patch;
            patches         (airfoil);
            interpolate     true;
            invariant       true;  // Unaffected by mesh motion
            surfaceFormat   raw;
        }
    }
}
